In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("raw_data.csv")

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [12]:
df2=df.copy()
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [21]:
df2=df2.bfill()  #if we read the backward ,the nan is replace by thw backward value
df2

    id          name  age country   gender   income
0    1      John Doe   29     USA     Male  55000.0
1    1      John Doe   29     USA     Male  55000.0
2    2    Jane Smith   29  Canada   Female  62000.0
3    3          Alex   29     USA  Unknown  47000.0
4    4  Maria Garcia   34   Spain   Female  47000.0
5    5        Li Wei   27   China     Male  51000.0
6    6        Li Wei   45   India   Female  73000.0
7    7    Ahmed Khan   38   India     Male  68000.0
8    8    Rachel Lee   29     USA   Female  62000.0
9    9   Carlos Ruiz   29  Mexico     Male  45000.0
10  10   Emily Davis   31     USA     Male  58000.0

In [30]:
# cleaning the data with handle dublicacy

df2.duplicated() 
# df[["country","gender"]].duplicated()
df2=df2.drop_duplicates()
df2=df2.reset_index(drop=True)
df2

   id          name  age country   gender   income
0   1      John Doe   29     USA     Male  55000.0
1   2    Jane Smith   29  Canada   Female  62000.0
2   3          Alex   29     USA  Unknown  47000.0
3   4  Maria Garcia   34   Spain   Female  47000.0
4   5        Li Wei   27   China     Male  51000.0
5   6        Li Wei   45   India   Female  73000.0
6   7    Ahmed Khan   38   India     Male  68000.0
7   8    Rachel Lee   29     USA   Female  62000.0
8   9   Carlos Ruiz   29  Mexico     Male  45000.0
9  10   Emily Davis   31     USA     Male  58000.0

In [54]:
# df2.to_csv("clear_data.csv")
# Grouping and agration

# making groups with the help of perameeters

df2.groupby("country")["income"].mean()
df2.groupby("country")["income"].min()
df2.groupby("country")["income"].max()

df2.groupby("gender")["income"].mean()
df2.groupby("gender")["income"].min()
df2.groupby("gender")["income"].max()
df2.groupby("gender")["income"].sum()

# multiple comparison in one line by agg
df2.groupby("gender")["income"].agg(["mean","sum","min","max","count"])
df2.groupby("country")["income"].aggregate(["mean","sum","min","max","count"])

df2.groupby("gender")["income"].agg(Avg_Salary="mean",Sum_of_Salary="sum",min_Salary="min",max_Salary="max",avg_count="count")
df2.groupby("country")["income"].agg(Avg_Salary="mean",Sum_of_Salary="sum",min_Salary="min",max_Salary="max",avg_count="count")

df2.groupby("country").agg({
    "income":"mean",
    "age":"mean"
})

df.groupby("country").agg({
    "income":"mean",
    "age":"max"
})

df.groupby("country").agg(
    Avg_Salary=("income","mean"),
    Avg_age=("age","mean")
)


df.groupby("country").agg(
    Max_Salary=("income","max"),
    Min_age=("age","min")
)

         Max_Salary  Min_age
country
Canada      62000.0      NaN
China       51000.0     27.0
India       73000.0     45.0
Mexico      45000.0      NaN
Spain           NaN     34.0
USA         62000.0     29.0